import React from 'react'
import styles from '../../info.module'

const CookiePolicy = () => (
	<div className={styles.content}>
		<h1>Политика использование куков</h1>
		<h4>Услуга</h4>
		<p>
			Настоящая Политика конфиденциальности применяется к InCase и Сервису,
			предоставляемому для продажи, покупки или обмена игровых предметов (далее
			– Сервис), включая маркетинговую деятельность на сайтах третьих лиц. DTS
			обрабатывает ваши персональные данные, предоставленные и собранные в ходе
			предоставления Услуг. Тем самым вы соглашаетесь с Условиями использования
			Сервиса InCase.
		</p>
		<div className={styles.delimiter}></div>
		<h4>1. Обработанные данные (включая категории данных)</h4>
		<div className={styles.paragraph}>
			<h5>Данные, полученные DTS от пользователей сервиса</h5>
			<p>
				Чтобы получить доступ к определенным функциям Сервиса, вам будет
				предложено указать личные данные платежной карты, номер телефона и адрес
				электронной почты. От вас не требуется предоставлять дополнительную
				информацию в своем профиле. Это не будет общедоступной информацией.
			</p>
			<h5>Данные, полученные DTS от третьих сторон</h5>
			<p>
				Потребует заполнение при использовании привязки аккаунтов, пока пусто
			</p>
			<h5>Транзакции и платежные данные</h5>
			<p>
				Осуществлять платежи через Сервис для пополнения виртуального счета
				невозможно. Однако это можно сделать с помощью других платежных систем,
				которые будут предлагаться в зависимости от вашего местоположения. DTS
				может передать выбранному вами поставщику платежных услуг контактную
				информацию для обеспечения транзакции и проведения проверок на предмет
				мошенничества. Аналогичным образом, DTS будет получать данные от
				оператора вашей платежной системы по тем же причинам. Мы также собираем,
				храним и обрабатываем информацию о наличии, обмене и предпочтениях ваших
				игровых предметов.
			</p>
			<h5>Cookies</h5>
			<p>
				Как описано в Политике использования файлов cookie, DTS использует файлы
				cookie и аналогичные технологии (такие как веб-маяки, рекламные теги и
				идентификаторы устройств) для идентификации вас и вашего устройства
				внутри Сервиса и за его пределами. Кроме того, DTS разрешает некоторым
				другим лицам использовать файлы cookie, как описано в Политике
				использования файлов cookie. Вы можете управлять файлами cookie в
				настройках своего браузера и другими способами. Вы также можете
				отказаться от использования файлов cookie и аналогичных технологий для
				отслеживания вашей активности на сторонних веб-сайтах для сторонних
				рекламодателей.
			</p>
			<h5>Информация о вашем устройстве и местоположении</h5>
			<p>
				Когда вы посещаете наш веб-сайт, DTS получает адрес веб-сайта, с
				которого вы вошли в систему. Кроме того, DTS получает информацию о вашем
				IP-адресе, прокси-сервере, веб-браузере, настройках цвета выбранного
				сайта, разрешении экрана, версии операционной системы и других данных,
				которые позволяют идентифицировать вас и ваше устройство.
			</p>
			<h5>Сообщения</h5>
			<p>
				Информация, отправленная вами в виде сообщений или комментариев на
				форуме на нашем сайте или в чате технической поддержки. Размещая
				информацию на форуме, вы делаете ее общедоступной. Информация,
				передаваемая в чате поддержки, является конфиденциальной и защищенной.
			</p>
		</div>
		<div className={styles.delimiter}></div>
		<h4>2. Цели обработки</h4>
		<div className={styles.paragraph}>
			<h5>Услуга</h5>
			<p>
				DTS использует ваши данные для предоставления доступа к Сервису для
				покупки, продажи и обмена игровыми предметами. В зависимости от вашего
				местоположения мы предоставляем список платежных систем, действующих в
				вашем регионе. Используя файлы cookie, мы сохраняем выбранный вами
				дизайн веб-сайта, язык и другие настройки для удобного использования
				Сервиса.
			</p>
			<h5>Маркетинг</h5>
			<p>
				DTS показывает рекламу посетителям веб-сайта как внутри Сервиса, так и
				за его пределами напрямую или через партнеров, используя следующие
				данные:
			</p>
			<div className={styles.paragraph}>
				<p>
					- данные, собранные с помощью маркетинговых технологий, включая
					рекламные теги, файлы cookie и идентификаторы устройств;
				</p>
				<p>- контактная информация, предоставленная пользователями Сервиса;</p>
				<p>
					- данные, полученные в результате использования Сервиса (история
					поиска, посещенные разделы сайта, просмотренные товары, выбор цветовой
					гаммы сайта и т.д.)
				</p>
				<p>- данные, сгенерированные на основе приведенных выше данных.</p>
			</div>
			<h5>Поддержка</h5>
			<p>
				DTS использует ваши данные для ответа на вопросы и жалобы по поводу
				Сервиса для рассмотрения и принятия решений.
			</p>
			<h5>Маркетинг</h5>
			<p>
				DTS использует ваши данные в целях безопасности и для расследования
				предполагаемого или фактического мошенничества или других незаконных
				действий.
			</p>
			<h5>Статистика</h5>
			<p>
				DTS использует ваши данные для получения и распространения сводной
				статистики, которая не позволяет идентифицировать вас. Например, чтобы
				подсчитать количество показов рекламы и кликов по ней, посещений и
				использования сервиса в разных регионах и странах.
			</p>
		</div>
		<div className={styles.delimiter}></div>
		<h4>3. Время обработки</h4>
		<div className={styles.paragraph}>
			DTS хранит ваши персональные данные до тех пор, пока существует ваша
			учетная запись или пока это необходимо для работы нашего сервиса. Даже
			если вы пользуетесь Сервисом раз в несколько лет при поиске, обмене,
			продаже или покупке товаров, мы сохраним ваши персональные данные и вашу
			учетную запись до тех пор, пока вы не закроете ее. После того, как вы
			закроете свою учетную запись, ваши персональные данные будут удалены,
			заблокированы или анонимизированы в соответствии с применимым
			законодательством, за исключением случаев, когда требования
			законодательства или другие преобладающие законные цели требуют более
			длительного хранения. Иногда невозможно полностью удалить данные из-за
			необходимости соблюдения последовательности обмена, продажи и покупки на
			торговой платформе. Если вы воспользуетесь правом возразить против
			обработки ваших персональных данных, мы рассмотрим ваше возражение и
			удалим данные, обработанные с заявленной целью, если только нет другого
			правового основания для обработки и хранения этих данных или если хранение
			этих данных не требуется в соответствии с применимым законодательством.
			Если вы отзовете свое согласие на обработку ваших персональных данных или
			данных вашего ребенка, мы удалим эти данные в той мере, в какой сбор и
			обработка данных основаны на согласии.
		</div>
		<div className={styles.delimiter}></div>
		<h4>4. Право пользователя</h4>
		<div className={styles.paragraph}>
			<p>
				Законы о защите данных, действующие на различных территориях,
				предоставляют права в отношении ваших персональных данных. Чтобы
				воспользоваться своими правами, вы можете связаться с нами, используя
				контактную информацию, указанную на веб-сайте, или через свой личный
				кабинет.
			</p>
			<h5>Право на информацию</h5>
			<p>
				Вы можете подать заявку на предоставление копии ваших персональных
				данных, отправив нам запрос любым возможным способом.
			</p>
			<h5>Право на исправление</h5>
			<p>
				Вы можете изменить некоторые свои персональные данные в своем личном
				кабинете или связаться с нами с просьбой изменить или исправить ваши
				данные, если они неточны.
			</p>
			<h5>Право быть забытым («забвение»)</h5>
			<p>
				Вы можете попросить нас удалить все или часть ваших персональных данных,
				например, если:
			</p>
			<div className={styles.paragraph}>
				<p>- они больше не нужны для первоначальных целей обработки;</p>
				<p>
					- согласие было использовано в качестве юридического основания для их
					обработки;
				</p>
				<p>
					- нет законного интереса в дальнейшей обработке персональных данных;
				</p>
				<p>- они были использованы в маркетинговых целях.</p>
			</div>
			<h5>Право на ограничение обработки</h5>
			<p>
				Вы можете попросить нас приостановить обработку всех или некоторых ваших
				персональных данных, например, если ваши персональные данные неточны или
				вы считаете, что они обрабатываются незаконно.
			</p>
			<h5>Право на переносимость данных</h5>
			<p>
				Вы можете попросить нас предоставить вам копию ваших персональных данных
				в машиночитаемом формате (например, xml, csv), предоставленную вами
				ранее.
			</p>
			<h5>Право на возражение</h5>
			<p>
				Вы можете попросить нас прекратить использование ваших персональных
				данных в целях прямого маркетинга.
			</p>
		</div>
		<div className={styles.delimiter}></div>
		<h4>5. Дети</h4>
		<div className={styles.paragraph}>
			<p>
				Мы рекомендуем родителям объяснять своим детям, когда они могут, а когда
				нет раскрывать свои персональные данные онлайн. Так же наш сайт, строго
				относится к возрасту пользователя, мы против, чтобы на нашем сайте были
				дети и люди не достигшие совершеннолетнего возраста
			</p>
		</div>
		<div className={styles.delimiter}></div>
		<h4>6. Трансграничная передача данных</h4>
		<div className={styles.paragraph}>
			DTS обрабатывает персональные данные как внутри Европейского союза (ЕС),
			так и за его пределами в соответствии с правовыми механизмами
			трансграничной передачи данных. Законы стран, в которых обрабатываются
			данные, могут отличаться от законов ЕС и могут быть менее эффективными в
			области защиты данных. В некоторых случаях мы используем стандартные
			договорные положения (SCC), принятые Европейской комиссией, в качестве
			механизма передачи данных из стран ЕС. Организации, занимающиеся
			обработкой персональных данных от имени DTS, приняли SCC, в
			соответствующих случаях, для обеспечения конфиденциальности, безопасности
			и законности обработки ваших персональных данных. Персональные данные
			пользователей Сервиса в настоящее время хранятся на территории РФ.
		</div>
		<div className={styles.delimiter}></div>
		<h4>7. Правовые основания для обработки</h4>
		<div className={styles.paragraph}>
			<h5>
				DTS обрабатывает персональные данные при наличии следующих законных
				оснований:
			</h5>
			<div className={styles.paragraph}>
				<p>- согласие (получено от вас);</p>
				<p>
					- соглашение (договорные отношения с вами по предоставлению доступа ко
					всем функциям нашего сервиса или отношения, предшествующие заключению
					контракта);
				</p>
				<p>- законный интерес;</p>
				<p>
					- юридические обязательства, налагаемые на нас по соблюдению
					действующего законодательства.
				</p>
			</div>
			<h5>
				Обработка персональных данных в соответствии с законными интересами
				осуществляется в следующих целях:
			</h5>
			<div className={styles.paragraph}>
				<p>
					- для защиты вас и нас самих от угроз конфиденциальности, безопасности
					и от мошеннических действий третьих сторон;
				</p>
				<p>
					- обеспечить соблюдение требований законодательства - обеспечить
					соблюдение требований законодательства;
				</p>
				<p>- анализировать и улучшать качество предоставляемых вам услуг;</p>
				<p>- обеспечить условия для нашего бизнеса.</p>
			</div>
		</div>
		<div className={styles.delimiter}></div>
		<p>
			Если обработка персональных данных осуществляется в соответствии с вашим
			согласием, вы имеете право отозвать его в любое время.
		</p>
		<p>
			Если обработка персональных данных осуществляется в соответствии с
			законными интересами, вы имеете право обжаловать эти интересы.
		</p>
	</div>
)

export default React.memo(CookiePolicy)
