import React from "react";

const CookiePolicy = () => {
    return(
        <div className="info-text">
            <h1>Политика использование куков</h1>
            <h4>Услуга</h4>
            <p>
                Настоящая Политика конфиденциальности применяется к InCase и Сервису, предоставляемому для продажи, покупки или обмена игровых предметов (далее – Сервис), включая маркетинговую деятельность на сайтах третьих лиц. DTS обрабатывает ваши персональные данные, предоставленные и собранные в ходе предоставления Услуг. 
                Тем самым вы соглашаетесь с Условиями использования Сервиса InCase.
            </p>
            <h4>1. Обработанные данные (включая категории данных)</h4>
            <div className="sub-items">
                <h5>Данные, полученные DTS от пользователей сервиса</h5>
                Чтобы получить доступ к определенным функциям Сервиса, вам будет предложено указать имя и фамилию, данные и отсканированную копию документа, удостоверяющего личность (паспорт, удостоверение личности, водительские права), адрес проживания, личные данные платежной карты, номер телефона и адрес электронной почты. От вас не требуется предоставлять дополнительную информацию в своем профиле. Это не будет общедоступной информацией.
                <h5>Данные, полученные DTS от третьих сторон</h5>
                Все функции сервиса InCase доступны после авторизации через Steam. Во время первой авторизации мы получаем ваш Steam ID, изображение пользователя и имя профиля от Valve Corporation. Steam ID используется для создания учетной записи Incase и предоставления пользователю информации о его игровых предметах Steam. В процессе создания учетной записи Incase вам будет присвоен идентификатор пользователя – уникальный цифровой номер Incase.
                <h5>Транзакции и платежные данные</h5>
                Осуществлять платежи через Сервис для пополнения виртуального счета невозможно. Однако это можно сделать с помощью других платежных систем, которые будут предлагаться в зависимости от вашего местоположения. DTS может передать выбранному вами поставщику платежных услуг контактную информацию для обеспечения транзакции и проведения проверок на предмет мошенничества. Аналогичным образом, DTS будет получать данные от оператора вашей платежной системы по тем же причинам. Мы также собираем, храним и обрабатываем информацию о наличии, обмене и предпочтениях ваших игровых предметов.
                <h5>Cookies</h5>
                Как описано в Политике использования файлов cookie, DTS использует файлы cookie и аналогичные технологии (такие как веб-маяки, рекламные теги и идентификаторы устройств) для идентификации вас и вашего устройства внутри Сервиса и за его пределами. Кроме того, DTS разрешает некоторым другим лицам использовать файлы cookie, как описано в Политике использования файлов cookie. Вы можете управлять файлами cookie в настройках своего браузера и другими способами. Вы также можете отказаться от использования файлов cookie и аналогичных технологий для отслеживания вашей активности на сторонних веб-сайтах для сторонних рекламодателей.
                <h5>Информация о вашем устройстве и местоположении</h5>
                Когда вы посещаете наш веб-сайт, DTS получает адрес веб-сайта, с которого вы вошли в систему. Кроме того, DTS получает информацию о вашем IP-адресе, прокси-сервере, веб-браузере, настройках цвета выбранного сайта, разрешении экрана, версии операционной системы и других данных, которые позволяют идентифицировать вас и ваше устройство.
                <h5>Сообщения</h5>
                Информация, отправленная вами в виде сообщений или комментариев на форуме на нашем сайте или в чате технической поддержки. Размещая информацию на форуме, вы делаете ее общедоступной. Информация, передаваемая в чате поддержки, является конфиденциальной и защищенной.
                <h5>Google Analytics</h5>
                Наш веб–сайт использует Google Analytics - сервис веб-аналитики Google, Inc. (Google). Google Analytics в основном использует сторонние файлы cookie для измерения вашего взаимодействия. Вы можете полностью отключить файлы cookie или удалить отдельные файлы cookie. Пожалуйста, смотрите более подробную информацию здесь: https://policies.google.com/technologies/cookies . Чтобы полностью отключить возможность сбора данных о посещенных сайтах, Google разработала дополнение для браузера Google Analytics Opt-out. https://tools.google.com/dlpage/gaoptout.
            </div>
            <h4>2. Цели обработки</h4>
            <div className="sub-items">
                <h5>Услуга</h5>
                DTS использует ваши данные для предоставления доступа к Сервису для покупки, продажи и обмена игровыми предметами. В зависимости от вашего местоположения мы предоставляем список платежных систем, действующих в вашем регионе. Используя файлы cookie, мы сохраняем выбранный вами дизайн веб-сайта, язык и другие настройки для удобного использования Сервиса.
                <h5>Маркетинг</h5>
                DTS показывает рекламу посетителям веб-сайта как внутри Сервиса, так и за его пределами напрямую или через партнеров, используя следующие данные:
                <p className="sub-items">
                    - данные, собранные с помощью маркетинговых технологий, включая рекламные теги, файлы cookie и идентификаторы устройств;<br/>
                    - контактная информация, предоставленная пользователями Сервиса;<br/>
                    - данные, полученные в результате использования Сервиса (история поиска, посещенные разделы сайта, просмотренные товары, выбор цветовой гаммы сайта и т.д.);<br/>
                    - данные, сгенерированные на основе приведенных выше данных.
                </p>
                <h5>Поддержка</h5>
                DTS использует ваши данные для ответа на вопросы и жалобы по поводу Сервиса для рассмотрения и принятия решений.
                <h5>Маркетинг</h5>
                DTS использует ваши данные в целях безопасности и для расследования предполагаемого или фактического мошенничества или других незаконных действий.
                <h5>Статистика</h5>
                DTS использует ваши данные для получения и распространения сводной статистики, которая не позволяет идентифицировать вас. Например, чтобы подсчитать количество показов рекламы и кликов по ней, посещений и использования сервиса в разных регионах и странах.
            </div>
            <h4>3. Время обработки</h4>
            <p className="sub-items">
                DTS хранит ваши персональные данные до тех пор, пока существует ваша учетная запись или пока это необходимо для работы нашего сервиса. Даже если вы пользуетесь Сервисом раз в несколько лет при поиске, обмене, продаже или покупке товаров, мы сохраним ваши персональные данные и вашу учетную запись до тех пор, пока вы не закроете ее. После того, как вы закроете свою учетную запись, ваши персональные данные будут удалены, заблокированы или анонимизированы в соответствии с применимым законодательством, за исключением случаев, когда требования законодательства или другие преобладающие законные цели требуют более длительного хранения. Иногда невозможно полностью удалить данные из-за необходимости соблюдения последовательности обмена, продажи и покупки на торговой платформе. Если вы воспользуетесь правом возразить против обработки ваших персональных данных, мы рассмотрим ваше возражение и удалим данные, обработанные с заявленной целью, если только нет другого правового основания для обработки и хранения этих данных или если хранение этих данных не требуется в соответствии с применимым законодательством. Если вы отзовете свое согласие на обработку ваших персональных данных или данных вашего ребенка, мы удалим эти данные в той мере, в какой сбор и обработка данных основаны на согласии.
            </p>
            <h4>4. Право пользователя</h4>
            <div className="sub-items">
                Законы о защите данных, действующие на различных территориях, предоставляют права в отношении ваших персональных данных. Чтобы воспользоваться своими правами, вы можете связаться с нами, используя контактную информацию, указанную на веб-сайте, или через свой личный кабинет.
                <h5>Право на информацию</h5>
                Вы можете подать заявку на предоставление копии ваших персональных данных, отправив нам запрос любым возможным способом.
                <h5>Право на исправление</h5>
                Вы можете изменить некоторые свои персональные данные в своем личном кабинете или связаться с нами с просьбой изменить или исправить ваши данные, если они неточны.
                <h5>Право быть забытым («забвение»)</h5>
                Вы можете попросить нас удалить все или часть ваших персональных данных, например, если:
                <p className="sub-items">
                    - они больше не нужны для первоначальных целей обработки;<br/>
                    - согласие было использовано в качестве юридического основания для их обработки;<br/>
                    - нет законного интереса в дальнейшей обработке персональных данных;<br/>
                    - они были использованы в маркетинговых целях.
                </p>
                <h5>Право на ограничение обработки</h5>
                Вы можете попросить нас приостановить обработку всех или некоторых ваших персональных данных, например, если ваши персональные данные неточны или вы считаете, что они обрабатываются незаконно.
                <h5>Право на переносимость данных</h5>
                Вы можете попросить нас предоставить вам копию ваших персональных данных в машиночитаемом формате (например, xml, csv), предоставленную вами ранее.
                <h5>Право на возражение</h5>
                Вы можете попросить нас прекратить использование ваших персональных данных в целях прямого маркетинга.
            </div>
            <h4>5. Дети</h4>
            <p className="sub-items">
                Поскольку основная информация, необходимая для работы нашего Сервиса, получена от корпорации Valve, мы придерживаемся аналогичной политики в отношении персональных данных детей (раздел 7 https://store.steampowered.com/privacy_agreement ). Мы рекомендуем родителям объяснять своим детям, когда они могут, а когда нет раскрывать свои персональные данные онлайн.
            </p>
            <h4>6. Трансграничная передача данных</h4>
            <p className="sub-items">
                DTS обрабатывает персональные данные как внутри Европейского союза (ЕС), так и за его пределами в соответствии с правовыми механизмами трансграничной передачи данных. Законы стран, в которых обрабатываются данные, могут отличаться от законов ЕС и могут быть менее эффективными в области защиты данных. В некоторых случаях мы используем стандартные договорные положения (SCC), принятые Европейской комиссией, в качестве механизма передачи данных из стран ЕС. Организации, занимающиеся обработкой персональных данных от имени DTS, приняли SCC, в соответствующих случаях, для обеспечения конфиденциальности, безопасности и законности обработки ваших персональных данных. Персональные данные пользователей Сервиса в настоящее время хранятся на территории РФ.
            </p>
            <h4>7. Правовые основания для обработки</h4>
            <div className="sub-items">
                <h5>DTS обрабатывает персональные данные при наличии следующих законных оснований:</h5>
                <p className="sub-items">
                    - согласие (получено от вас);<br/>
                    - соглашение (договорные отношения с вами по предоставлению доступа ко всем функциям нашего сервиса или отношения, предшествующие заключению контракта);<br/>
                    - законный интерес;<br/>
                    - юридические обязательства, налагаемые на нас по соблюдению действующего законодательства.
                </p>
                <h5>Обработка персональных данных в соответствии с законными интересами осуществляется в следующих целях:</h5>
                <p className="sub-items">
                    - для защиты вас и нас самих от угроз конфиденциальности, безопасности и от мошеннических действий третьих сторон;<br/>
                    - обеспечить соблюдение требований законодательства - обеспечить соблюдение требований законодательства;<br/>
                    - анализировать и улучшать качество предоставляемых вам услуг;<br/>
                    - обеспечить условия для нашего бизнеса.
                </p>
                Если обработка персональных данных осуществляется в соответствии с вашим согласием, вы имеете право отозвать его в любое время.<br/>
                Если обработка персональных данных осуществляется в соответствии с законными интересами, вы имеете право обжаловать эти интересы.<br/>
            </div>
        </div>
    ); 
};

export default CookiePolicy;