import React from "react";

const CookiePolicy = () => {
    return(
        <div className="info-text">
            <h1>Политика использование куков</h1>
            <h4>Услуга</h4>
            <p>
                Настоящая Политика конфиденциальности применяется к InCase и Сервису, предоставляемому для продажи, покупки или обмена игровых предметов (далее – Сервис), включая маркетинговую деятельность на сайтах третьих лиц. DTS обрабатывает ваши персональные данные, предоставленные и собранные в ходе предоставления Услуг. 
                Тем самым вы соглашаетесь с Условиями использования Сервиса InCase.
            </p>
            <h4>1. Обработанные данные (включая категории данных)</h4>
            <p className="sub-items">
                <h5>Данные, полученные DTS от пользователей сервиса</h5>
                Чтобы получить доступ к определенным функциям Сервиса, вам будет предложено указать имя и фамилию, данные и отсканированную копию документа, удостоверяющего личность (паспорт, удостоверение личности, водительские права), адрес проживания, личные данные платежной карты, номер телефона и адрес электронной почты. От вас не требуется предоставлять дополнительную информацию в своем профиле. Это не будет общедоступной информацией.
                <h5>Данные, полученные DTS от третьих сторон</h5>
                Все функции сервиса InCase доступны после авторизации через Steam. Во время первой авторизации мы получаем ваш Steam ID, изображение пользователя и имя профиля от Valve Corporation. Steam ID используется для создания учетной записи Incase и предоставления пользователю информации о его игровых предметах Steam. В процессе создания учетной записи Incase вам будет присвоен идентификатор пользователя – уникальный цифровой номер Incase.
                <h5>Транзакции и платежные данные</h5>
                Осуществлять платежи через Сервис для пополнения виртуального счета невозможно. Однако это можно сделать с помощью других платежных систем, которые будут предлагаться в зависимости от вашего местоположения. DTS может передать выбранному вами поставщику платежных услуг контактную информацию для обеспечения транзакции и проведения проверок на предмет мошенничества. Аналогичным образом, DTS будет получать данные от оператора вашей платежной системы по тем же причинам. Мы также собираем, храним и обрабатываем информацию о наличии, обмене и предпочтениях ваших игровых предметов.
                <h5>Cookies</h5>
                Как описано в Политике использования файлов cookie, DTS использует файлы cookie и аналогичные технологии (такие как веб-маяки, рекламные теги и идентификаторы устройств) для идентификации вас и вашего устройства внутри Сервиса и за его пределами. Кроме того, DTS разрешает некоторым другим лицам использовать файлы cookie, как описано в Политике использования файлов cookie. Вы можете управлять файлами cookie в настройках своего браузера и другими способами. Вы также можете отказаться от использования файлов cookie и аналогичных технологий для отслеживания вашей активности на сторонних веб-сайтах для сторонних рекламодателей.
                <h5>Информация о вашем устройстве и местоположении</h5>
                Когда вы посещаете наш веб-сайт, DTS получает адрес веб-сайта, с которого вы вошли в систему. Кроме того, DTS получает информацию о вашем IP-адресе, прокси-сервере, веб-браузере, настройках цвета выбранного сайта, разрешении экрана, версии операционной системы и других данных, которые позволяют идентифицировать вас и ваше устройство.
                <h5>Сообщения</h5>
                Информация, отправленная вами в виде сообщений или комментариев на форуме на нашем сайте или в чате технической поддержки. Размещая информацию на форуме, вы делаете ее общедоступной. Информация, передаваемая в чате поддержки, является конфиденциальной и защищенной.
                <h5>Google Analytics</h5>
                Наш веб–сайт использует Google Analytics - сервис веб-аналитики Google, Inc. (Google). Google Analytics в основном использует сторонние файлы cookie для измерения вашего взаимодействия. Вы можете полностью отключить файлы cookie или удалить отдельные файлы cookie. Пожалуйста, смотрите более подробную информацию здесь: https://policies.google.com/technologies/cookies . Чтобы полностью отключить возможность сбора данных о посещенных сайтах, Google разработала дополнение для браузера Google Analytics Opt-out. https://tools.google.com/dlpage/gaoptout.
            </p>
            <h4>2. Цели обработки</h4>
        </div>
    ); 
};

export default CookiePolicy;