import React from "react";

const UserAgreement = () => {
    return(
        <div className="info-text">
            <h1>Пользовательское соглашение</h1>
            <h3>Внимание! Пожалуйста, ознакомьтесь с настоящим пользовательским соглашением до начала использования сайта incase.games и его программных средств.</h3>
            <p>Регистрация (авторизация) на сайте будет означать ваше согласие с условиями настоящего пользовательского соглашения.</p>
            <p>Если Вы не согласны с условиями настоящего пользовательского соглашения, не регистрируйтесь (авторизируйтесь) на сайте и не используйте его программные средства.</p>
            <p>Администратор с одной стороны и лицо, принявшее предложение, размещенное на интернет-сайте https://incase.games/user-agreement, с другой стороны, заключили настоящее пользовательское соглашение следующим образом.</p>
            <h4>1. Термины и определения</h4>
            <p>
                1.1. В настоящем пользовательском соглашении, если из текста прямо не вытекает иное, следующие термины будут иметь указанные ниже значения:
                <p>«Пользователь» - Физическое лицо, имеющее аккаунт Steam, заключившее с Владельцем Соглашение.</p>
                <p>«Сайт» - Составные произведения, представляющие собой совокупность информации, текстов, графических элементов, дизайна, изображений, фото и видеоматериалов, программ для ЭВМ, иных результатов интеллектуальной деятельности, за исключением Инвентаря, содержащихся в информационной системе, обеспечивающей доступность такой информации в сети Интернет в пределах доменной зоны incase.games</p>
                <p>«Соглашение» - Настоящее пользовательское соглашение.</p>
                <p>«Стороны» - Владелец и Пользователь.</p>
                <p>«Инка, Инкоин, InCoin» - Внутренняя цифровая валюта, используемая для оплаты товаров и услуг внутри проекта. При покупке инкоина учитывается актуальный курс конвертации фиатной валюты: 1 RUB = 7 инкоинов. Название валюты не зависит от буквенного регистра</p>
                1.2. Все остальные термины и определения, встречающиеся в тексте Соглашения, толкуются Сторонами в соответствии с законодательством России и сложившимися в сети Интернет обычными правилами толкования соответствующих терминов.<br/>
                1.3. Названия заголовков (статей) Соглашения предназначены исключительно для удобства пользования текстом Соглашения и буквального юридического значения не имеют.
            </p>
            <h4>2. Заключение Соглашения</h4>
            <p>
                2.1. Текст Соглашения, постоянно размещенный в сети Интернет по сетевому адресу https://Incase.app/agreement и доступный при регистрации (авторизации) на Сайте, содержит все существенные условия Соглашения и является предложением Владельца заключить Соглашение с любым полностью дееспособным третьим лицом, использующим Сайт, на указанных в тексте Соглашения условиях. Текст Соглашения является публичной офертой в соответствии с законодательством Российской Федерации.<br/>
                2.2. Надлежащее принятие этого предложения в соответствии с законодательством России - это последовательное выполнение третьей стороной следующих действий:<br/>
                2.2.1. Ознакомление с условиями Соглашения;<br/>
                2.2.2. Проставление символа в специальном поле под заголовком «Я принимаю условия пользовательского соглашения»;<br/>
                2.2.3. Авторизация на Сайте путем перехода по ссылке «Войти через Steam» и осуществления авторизации в открывшемся окне через уже имеющийся аккаунт Steam или путем создания нового аккаунта Steam.<br/>
            </p>
            <h4>3. Предмет Соглашения</h4>
        </div>
    ); 
};

export default UserAgreement;